---
kind: property
id: P:Autodesk.Revit.DB.Architecture.TopographySurface.IsSiteSubRegion
source: html/0b588314-98cf-1c23-9cbc-631ebcaff784.htm
---
# Autodesk.Revit.DB.Architecture.TopographySurface.IsSiteSubRegion Property

Identifies if this element represents a subregion.

## Syntax (C#)
```csharp
public bool IsSiteSubRegion { get; }
```